Repository: bhuisgen/fmon
Catalog: po/*.po
Languages: fr

source: error in configuration file
fr: erreur dans le fichier de configuration

source: no group 'main'
fr: aucun groupe 'main'

source: the first group is not 'main'
fr: le premier groupe n'est pas 'main'

source: error in configuration file, aborting reload
fr: erreur dans le fichier de configuration, rechargement ignoré

source: no watcher group found
fr: aucun groupe de sonde trouvé

source: invalid path
fr: chemin invalide

source: file/path doesn't exist
fr: fichier/répertoire inexistant

source: bad permissions on file
fr: droits incorrects sur le fichier

source: bad permissions on path
fr: droits incorrects sur le fichier

source: recursion is enabled but path is not a directory
fr: la récursion est activé mais le path n'est pas un répertoire

source: invalid maximum depth of recursion
fr: niveau maximum de récursion invalide

source: invalid event
fr: évènement invalide

source: invalid size comparator
fr: comparateur de taille invalide

source: invalid size
fr: taille invalide

source: invalid size unit
fr: unité de taille invalide

source: invalid type
fr: type invalide

source: watchers already started
fr: sondes déjà démarrées

source: starting watchers
fr: démarrage des sondes

source: mount watcher started
fr: sonde de montage démarrée

source: watcher started
fr: sonde activée

source: watchers already stopped
fr: sondes déjà arrêtées

source: stopping watchers
fr: arrêt des sondes

source: mount watcher stopped
fr: sonde de montage arrêtée

source: watcher stopped
fr: sonde arrêtée

source: watchers stopped
fr: sondes arrêtées

source: listing monitors
fr: liste des moniteurs

source: Read configuration from file
fr: Lire la configuration depuis le fichier

source: FILE
fr: FICHIER

source: Set verbose output
fr: Fixe le niveau de verbosité

source: Show version information
fr: Affiche les informations de version

source: Path to watch for events
fr: Chemin à inspecter pour les évènements

source: Enable recursive mode
fr: Active le mode récursif

source: Maximum depth of recursion
fr: Niveau maximum de récursion

source: LEVEL
fr: NIVEAU

source: Event to watch
fr: Evènement à inspecter

source: EVENT
fr: EVENEMENT

source: Don't descend directories on other filesystems
fr: Ne pas traverser les répertoires sur les systèmes de fichiers différents

source: Matches files which are readable
fr: Vérifie que les fichiers ont les permissions de lecture

source: Matches files which are writable
fr: Vérifie que les fichiers ont les permissions d'écriture

source: Matches files which are executable and directories which are searchable
fr: Vérifie que les fichiers sont exécutables et que les répertoires sont recherchables

source: Matches files using given size
fr: Vérifie que les fichiers occupent la taille spécifiée

source: Check file type
fr: Vérifie le type du fichier

source: Check owner user
fr: Vérifie l'utilisateur propriétaire du fichier

source: NAME
fr: NOM

source: Check owner group
fr: Vérifie le groupe propriétaire du fichier

source: Include files list
fr: Liste de fichiers à inclure

source: LIST
fr: LISTE

source: Exclude files list
fr: Liste de fichiers à exclure

source: Execute command on event
fr: Exécute la commande lors d'un évènement

source: COMMAND
fr: COMMANDE

source: Print filename on event, followed by a newline
fr: Affiche le nom du fichier lors d'un évènement, suivi d'un retour à la ligne

source: Print filename on event, followed by a null character
fr: Affiche le nom du fichier lors d'un évènement, suivi d'un caractère nul

source: [WATCHER]
fr: [SONDE]

source: watcher
fr: sonde

source: Watcher Options
fr: Options Sonde

source: Show all watcher options
fr: Affiche toutes les options d'une sonde

source: The configuration file doesn't exist or cannot be read.
fr: Le fichier de configuration n'existe pas ou ne peut être lu.

source: SIGPIPE received, continuing execution
fr: SIGPIPE reçu, poursuite de l'exécution

source: SIGHUP received, reloading configuration
fr: SIGHUP reçu, rechargement de la configuration

source: SIGINT received, exiting
fr: SIGINT reçu, abandon de l'exécution

source: SIGTERM received, exiting
fr: SIGTERM reçu, abandon de l'exécution

source: SIGUSR1 received, starting watchers
fr: SIGUSR1 reçu, démarrage des sondes

source: SIGUSR2 received, stopping watchers
fr: SIGUSR2 reçu, arrêt des sondes

source: cleanup
fr: nettoyage

source: daemon stopped
fr: démon arrêté

source: GLib version 2.6.0 or above is needed
fr: La librairie GLib version 2.6.0 ou supérieure est requise

source: Failed to create events logger.
fr: Echec de création du journaliseur d'évènements

source: failed to daemonize, error code
fr: échec de démonisation, code d'erreur

source: daemon started
fr: démon démarré

source: mount event received
fr: évènement de montage reçu

source: path unmounted
fr: chemin démonté

source: path has no parent
fr: le chemin n'a pas de parent

source: path matches
fr: correspondance du chemin

source: path has not the same prefix
fr: le chemin n'a pas le même préfixe

source: watcher updated
fr: sonde mise à jour

source: event ignored
fr: évènement ignoré

source: path mounted
fr: chemin monté

source: creating file monitor for path
fr: création du moniteur de fichier pour le chemin

source: failed to create file monitor
fr: échec de création du moniteur de fichier, code d'erreur

source: maximum depth of recursion reached
fr: le niveau maxium de récursion a été atteint

source: failed to create file enumerator
fr: échec de création du moniteur de fichier

source: failed to iterate during file enumeration
fr: échec d'itération durant l'énumération des fichiers

source: removing file monitor for path
fr: suppression du moniteur de fichier pour le chemin

source: file monitor cancelled
fr: moniteur de fichiers annulé

source: file monitor already cancelled
fr: moniteur de fichiers annulé

source: removing file monitors for recursive path
fr: suppression des moniteurs de fichiers pour le chemin récursif

source: end of list
fr: fin de liste

source: watcher event received
fr: évènement reçu par la sonde

source: unknown event
fr: évènement inconu

source: failed to stat the watcher path
fr: échec d'obtention du statut sur le chemin de la sonde

source: failed to stat the watched file
fr: échec d'obtention du statut sur le fichier sondé

source: the filesystems are not the same
fr: les systèmes de fichiers ne sont pas identiques

source: the file is not readable
fr: le fichier n'a pas les permissions de lecture

source: the file is not writable
fr: le fichier n'a pas les permissions d'écriture

source: the file is not executable
fr: le fichier n'a pas les permissions d'exécution

source: the file size is not greater
fr: la taille du fichier n'est pas supérieure

source: the file size is not less
fr: la taille du fichier n'est pas inférieure

source: the file size is not equal
fr: la taille du fichier n'est pas égale

source: the file type doesn't match
fr: le type de fichier ne correspond pas

source: the file type is unknown
fr: le type de fichier est inconnu

source: failed to retrieve the user name, trying the user id
fr: échec de récupération du nom de l'utilisateur, essai sur l'identifiant utilisateur

source: invalid value
fr: valeur invalide

source: failed to retrieve the user id
fr: échec de récupération de l'identifiant utilisateur

source: the owner user matches
fr: l'utilisateur propriétaire correspond

source: failed to retrieve the group name, trying the group id
fr: échec de récupération du nom du groupe, essai sur l'identifiant de groupe

source: failed to retrieve the group id
fr: échec de récupération de l'identifiant de groupe

source: the owner group matches
fr: le groupe propriétaire correspond

source: relative filename found in include list
fr: nom relatif trouvé dans la liste d'inclusion

source: relative filename found in exclude list
fr: nom relatif trouvé dans la liste d'exclusion

source: event fired
fr: évènement signalé

source: executing command
fr: exécution de la commande

source: failed to execute command
fr: échec lors de l'exécution de la commande
